# Семинар 7. Непараметрические тесты
# 1-4 задачи решать с помощью функций, 5-ю вручную

from math import sqrt
import numpy as np
import scipy.stats as stats

'''
Выберете тест и проверьте, есть ли различия между выборками:
Задача 1. Даны две независимые выборки. Не соблюдается условие нормальности
x1 380, 420, 290
y1 140, 360, 200, 900
Сделайте вывод по результатам, полученным с помощью функции, имеются ли 
статистические различия между группами?
'''
# H0 -различий нет, Н1 - различия есть

x1 = np.array([380, 420, 290])
y1 = np.array([140, 360, 200, 900])
alpha = 0.05

print(stats.mannwhitneyu(x1, y1))
print('pvalue принимает высокое значение => H0 => статистически значимых различий нет')
print('=================================================================================')


'''
Задача 2. Исследовалось влияние препарата на уровень давления пациентов. Сначала
измерялось давление до приема препарата, потом через 10 минут и через 30 минут. Есть
ли статистически значимые различия между измерениями давления? 
В выборках не соблюдается условие нормальности.
1е измерение до приема препарата: 150, 160, 165, 145, 155
2е измерение через 10 минут: 140, 155, 150, 130, 135
3е измерение через 30 минут: 130, 130, 120, 130, 125
'''
# H0 -различий нет, Н1 - различия есть
a = ([150, 160, 165, 145, 155])
b = ([140, 155, 150, 130, 135])
c = ([130, 130, 120, 130, 125])
alpha = 0.05

print(stats.friedmanchisquare(a, b, c))
print('pvalue принимает низкое значение => H1 => есть статистически значимые различия')
print('=================================================================================')


'''
Задача 3. Сравните 1 и 2е измерения, предполагая, что 3го измерения через 30 минут не было. 
Есть ли статистически значимые различия между измерениями давления?
'''
print(stats.wilcoxon(a, b))
print('pvalue > alpha => H0 => статистически значимых различий нет')
print('=================================================================================')

'''
Задача 4. Даны 3 группы учеников плавания. Не соблюдается условие нормальности.
В 1 группе время на дистанцию 50 м составляют: 56, 60, 62, 55, 71, 67, 59, 58, 64, 67
Вторая группа : 57, 58, 69, 48, 72, 70, 68, 71, 50, 53
Третья группа: 57, 67, 49, 48, 47, 55, 66, 51, 54
Есть ли статистически значимые различия между группами?
'''

d = np.array([56, 60, 62, 55, 71, 67, 59, 58, 64, 67])
e = np.array([57, 58, 69, 48, 72, 70, 68, 71, 50, 53])
f = np.array([57, 67, 49, 48, 47, 55, 66, 51, 54])
alpha = 0.05
print(stats.kruskal(d, e, f))
print('pvalue > alpha => H0 => статистически значимых различий нет')
print('=================================================================================')


'''
Задача 5. Заявляется, что партия изготавливается со средним арифметическим 2,5 см. Проверить
данную гипотезу, если известно, что размеры изделий подчинены нормальному закону
распределения. Объем выборки 10, уровень статистической значимости 5%
2.51, 2.35, 2.74, 2.56, 2.40, 2.36, 2.65, 2.7, 2.67, 2.34
'''
# H0 = M, Н1 != M
alpha = 0.05
n = 10
M = 2.5
selection = np.array([2.51, 2.35, 2.74, 2.56, 2.40, 2.36, 2.65, 2.7, 2.67, 2.34])
mean = np.mean(selection)
sigma = np.std(selection, ddof=1)
t_sl = (mean - M) / (sigma / np.sqrt(n))     # t_t табличное ~ 2.26
print(round(t_sl, 2))
print('Расчётное t < t табличное => H0')
print('=================================================================================')

